{"1": "Magic Quadrant for Secure Web Gateway\nGartner RAS Core Research Note G00172783, Peter Firstbrook, Lawrence Orans, 8 January 2010\nThe SWG market continues to experience solid growth as\nenterprise customers scramble to improve defenses from\nan increasingly hostile Internet and safely use increasingly\ninteractive Web applications.\nWHAT YOU NEED TO KNOW\nThe secure Web gateway (SWG) is a critical tool for protecting endpoints from various forms\nof malware and other security risks, and for monitoring and controlling potentially dangerous\nE\nL Web traffic.\nP\nM Proactive inbound and outbound security filtering technology should be the No. 1\nA consideration when selecting an SWG solution.\nS\nEase of administration and scalable reporting is the second most important consideration,\nand there is significant differentiation in this aspect of solutions.\nOrganizations must consider mobile devices and smaller branch offices when selecting\nsolutions, and highly weight Web security as a service (SecaaS) delivery capabilities.\nWeb application control and data loss prevention are important considerations for future-\nproofing investments; however, these features are not very mature or widespread.\nMAGIC QUADRANT\nMarket Overview\nThe SWG market continues to evolve rapidly. Enterprise IT organizations are under business\npressure to open up their networks to Internet applications, while struggling to keep Internet-\nconnected endpoints free from malware. SWGs provide filtering and control over the Internet\nwhile enabling the broader use of beneficial interactive Web applications. As a result, security\nhas eclipsed employee productivity monitoring (i.e., URL filtering) as a primary motivator of\nbuyers in this market. SWG buyers are typically “Type A” security-conscious organizations in\nindustries such as finance, government agencies, defense, high-tech and pharmaceuticals.\nHowever, we are starting to see more broad-based horizontal distribution of organizations\nlooking at SWGs to improve their endpoint security posture. Typically, these mainstream\nadopters have been infected by malware, and an SWG represents the fastest and often least-\nexpensive means to improve endpoint security to thwart future infections.\nInnovation and feature development are still being driven by smaller, dedicated SWG\ncompanies; the traditional incumbent URL-filtering, antivirus and proxy cache vendors are\nstill playing catch-up. Despite rapid feature development, we still find it difficult in this market\nto select vendors that satisfy buyers in all product features. Organizations should carefully\nconsider their needs before they attempt to select vendors, and stay focused on needs\nduring the selection process.", "2": "2\nBuyers should consider the URL Figure 1. Magic Quadrant for Secure Web Gateway\ncategorization (particularly dynamic\ncategorization) and security “service” or challengers leaders\n“subscription” aspect of the solution to be\nof critical importance, and look for vendors\nthat have the resources to stay current with\nthe rapidly changing content and threat\nlandscape.\nSecurity remains the No. 1 differentiator and\nprimary purpose of an SWG. We put extra\nemphasis this year on real-time detection\ntechniques that go well beyond file signature,\nURL categorization or static policy-based\nprotection mechanisms. Unfortunately,\nreal-time security detection methods are\nvery difficult to evaluate and test, and no\nstandard testing methodology has emerged.\nWe recommend organizations test shortlist\nsolutions in their networks to gather real-\nworld results.\nURL classification and reporting is a close\nsecond critical capability, especially given that\nmost organizations would like to consolidate\nproxy, application control, security and URL\nfiltering/reporting into a single solutionS, and AMPLE\nleverage the existing URL-filtering budget. To\ndo this, they need, at a minimum, to replicate\nexisting reporting, and ideally improve on it niche players visionaries\nwith more-dynamic dashboards, graphical\nreporting and better custom report creation\ncompleteness of vision\ncapabilities. As more and more Web content\nbecomes user generated, organizations Source: Gartner (January 2010)\nthat are concerned about acceptable usage\nshould seek out solutions that offer real-time\ncontent classification in the gateway based on\nkeyword analysis and other indicators. The delivery model for SWG solutions is expanding from traditional\nappliances and software, with the addition of virtual appliances\nWeb application control, and in particular bandwidth management that can operate on VMware and blade servers. The SecaaS\nof applications, is an increasing requirement as organizations try market continues to heat up with significant enterprise interest as\nto keep costs down and improve critical application performance. evidenced by increasing shortlist inclusions and acquisitions of\nData loss prevention (DLP) continues to be a differentiator of SecaaS providers by traditional appliance vendors. During 2009, we\nsolutions, and we expect that more SWG vendors will add DLP have seen Symantec acquire MessageLabs; McAfee acquire MX\ncapability in 2010. However, enterprise needs for DLP are still logic; Cisco acquire ScanSafe; and Barracuda Networks acquire\nembryonic, and buyers must be careful to consider DLP across all Purewire. The ability to protect and apply policy to mobile endpoints\nchannels. DLP policy synchronization is one of the primary reasons is a significant benefit of SecaaS providers as organizations seek to\nfor integration of Web and e-mail security gateways; however, this improve protection for these often infected devices. Currently, well\ncapability is still rare — even among providers with both solutions. more than 85% of SecaaS buyers are less than 1,000 seats, but\nadoption by larger organizations, including some with well more than\n100,000 seats, is growing. Larger organizations typically see SecaaS\nThe Magic Quadrant is copyrighted January 2010 by Gartner, Inc. and is reused with permission. The Magic Quadrant is a graphical representation of a\nmarketplace at and for a specific time period. It depicts Gartner’s analysis of how certain vendors measure against criteria for that marketplace, as defined by\nGartner. Gartner does not endorse any vendor, product or service depicted in the Magic Quadrant, and does not advise technology users to select only those\nvendors placed in the “Leaders” quadrant. The Magic Quadrant is intended solely as a research tool, and is not meant to be a specific guide to action. Gartner\ndisclaims all warranties, express or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose.\n© 2009 Gartner, Inc. and/or its Affiliates. All Rights Reserved. Reproduction and distribution of this publication in any form without prior written permission\nis forbidden. The information contained herein has been obtained from sources believed to be reliable. Gartner disclaims all warranties as to the accuracy,\ncompleteness or adequacy of such information. Although Gartner’s research may discuss legal issues related to the information technology business, Gartner\ndoes not provide legal advice or services and its research should not be construed or used as such. Gartner shall have no liability for errors, omissions or\ninadequacies in the information contained herein or for interpretations thereof. The opinions expressed herein are subject to change without notice.\netucexe\not\nytiliba\nBlue Coat Systems\nSymantec Cisco\nWebsense\nTrend Micro\nMcAfee\nBarracuda Networks\nContentKeeper Technologies M86 Security\nZscaler\nFaceTime Communications CA\nWebroot Software SafeNet\nCymphonix\nOptenet\nClearswift\nAs of January 2010", "3": "3\nas a way to reduce network costs, as well as protect and manage Dropped\nmobile endpoints and smaller branch offices, while simplifying\nMarshal and 8e6 merged, and the newly formed company later\ninstallation and ongoing management.\nacquired Finjan Software, and renamed itself M86 Security. Secure\nComputing was acquired by McAfee, ScanSafe was acquired\nMarket Definition/Description by Cisco, MessageLabs and Mi5 Networks were acquired by\nThe SWG market is a composite market made up of multiple security Symantec, and Aladdin was acquired by SafeNet. These products\nmarkets. URL filtering is the largest submarket. Other submarkets now appear under the parent company. CP Secure was acquired\ninclude antivirus filtering for Web traffic, proxy caches and dedicated by Netgear. Netgear is incorporating CP Secure’s technology into\nmultifunctional SWG devices. Market distinctions are rapidly blurring its ProSecure unified threat management appliances, which don’t\nas submarket vendors maneuver to compete in the broader SWG meet the inclusion criteria for this Magic Quadrant.\nmarket, making market size estimates more difficult. We estimate\nthat the total composite market in 2008 exceeded $1.2 billion and Evaluation Criteria\nwas growing at a rate of 12% year over year. This is a significant\nAbility to Execute\ndecline from the 44% growth rate reported last year. This decline is\ndue, in part, to changes in our market sizing methodology to more Vertical positioning on the Ability to Execute (see Table 1) axis was\naccurately reflect non-SWG revenue from multifunction market determined by evaluating these factors:\nvendors, increasing price competition and slower-than-expected\ngrowth in 4Q08. We expect that the average market growth rate will\n• Overall viability — The company’s financial strength, as well\nincrease to around the 15% range in 2010. This growth increase will\nas the SWG business unit’s visibility and importance for\nbe fueled partly by pent-up demand resulting from delayed projects.\nmultiproduct companies\nThe dedicated SWG was the fastest-growing submarket, with\napproximately 80% year-over-year growth.\n• Sales execution/pricing — A comparison of pricing relative to\nthe market\nInclusion and Exclusion Criteria\nThese criteria must be met to be included in this Magic Quadrant:\nSAMP• LMarkEet responsiveness and track record — The speed in which\nthe vendor has spotted a market shift and produced a product\n• Vendors must own unique content capability in at least one of that potential customers are looking for; as well as the size of\nthese categories: URL filtering, anti-malware or application-level the vendor’s installed base relative to the amount of time the\ncontrols. This includes granular active content policies, dynamic product has been on the market\nclassification of websites and Web “reputation” systems, in\naddition to traditional anti-spyware and anti-spyware engines\n• Customer experience — Quality of the customer experience\nand URL lists.\nbased on reference calls and Gartner client teleconferences\n• Vendors must have at least 50 production enterprise\n• Operations — Corporate resources (in other words,\ninstallations.\nmanagement, business facilities, threat research, support and\ndistribution infrastructure) that the SWG business unit can draw\n• SWG products that offer firewall functionality — for example, on to improve product functionality, marketing and sales\nmultifunction firewalls (also known as unified threat management\n[UTM] devices) — are outside the scope of this analysis. These\ndevices are traditional network firewalls that also combine Table 1. Ability to Execute Evaluation Criteria\nnumerous network security technologies — such as anti-spam,\nEvaluation Criteria Weighting\nantivirus, network intrusion prevention system and URL filtering\n— into a single box. Multifunction firewalls are compelling for\nProduct/Service No rating\nthe small or midsize business (SMB) and branch office markets;\nhowever, in most circumstances, enterprise buyers do not\nOverall Viability (Business Unit, Financial, High\nconsider multifunction firewalls as replacements for SWGs.\nStrategy, Organization)\nExamples of vendors with multifunction firewall solutions include\nAstaro, Check Point Software Technologies, Fortinet and Sales Execution/Pricing Standard\nSonicWALL.\nMarket Responsiveness and Track Record High\n• Vendors that rebrand and sell complete SWG solutions are not\nMarketing Execution No rating\nincluded. For example, Google resells Cisco/ScanSafe. Google\nis not included in this analysis; but Cisco/ScanSafe is included.\nCustomer Experience High\nAdded Operations Standard\nSafeNet acquired Aladdin, and Symantec acquired Mi5 Networks\nSource: Gartner (January 2010)\nand MessageLabs. ZScaler and Optenet are new vendors added\nthis year because they met the inclusion criteria.", "4": "4\nCompleteness of Vision over IP (VoIP), blogs, data-sharing portals, Web backup, remote\nPC access, Web conferencing, chat and streaming media, is\nThe Completeness of Vision (see Table 2) axis captures\nstill immature in most products and represents a significant\nthe technical quality and completeness of the product and\ndifferentiator. We considered the number of named applications\norganizational characteristics, such as how well the vendor\nthat can be effectively blocked by checking a box on the\nunderstands this market, its history of innovation, its marketing and\napplication category or a specific named application. The ability\nsales strategies, and its geographic presence.\nto selectively block specific features of applications and the\npresence of predeveloped policies to simplify deployment were\nIn “market understanding,” we ranked vendors on the strength of\ngiven extra credit.\ntheir commitment to the SWG market in the form of strong product\nmanagement, their vision for the SWG market and the degree to\nwhich their road maps reflected a solid commitment of resources to • Manageability/scalability — Features that enhance the\nachieve that vision. administration experience and minimize administration\noverhead were compared. Extra credit was given to\nIn the product evaluation, we ranked vendors on these capabilities: products with a mature task-based management interface,\nconsolidated monitoring and reporting capabilities, and role-\nbased administration capability. Features such as policy\n• Malware filtering — The most important capability in this\nsynchronization between devices and multiple network\nanalysis is the ability to filter malware from all aspects of\ndeployment options enhance the scalability and reliability of\ninbound and outbound Web traffic. Signature-based malware\nsolutions.\nfiltering is standard on almost all products evaluated.\nConsequently, extra credit was given for non-signature-based\ntechniques for detecting malicious code and websites in • Delivery models — We looked at deployment options and form\nreal time as it crosses the gateway, as well as the range of factors. Appliance and software are standard. Extra credit was\ninspected protocols, ports and traffic types. Products that can given to vendors that offer multiple form factors, such as Virtual\nidentify infected PCs and the infection by name, and enable appliances for VMware or other hypervisors and/or SecaaS\nprioritized remediation, received extra credit. delivery models. We also looked at network deployment\nSAMPLoptioEns, such as Proxy vs. in-line bridge, Internet Content\nAdaptation Protocol (ICAP) and Web Cache Communication\n• URL filtering — Databases of known websites are categorized\nProtocol (WCCP) compatibility.\nby subject matter into groups to enforce acceptable use and\nproductivity and to reduce security risks. To displace incumbent\nURL-filtering products and “steal” allocated budget, SWG • Related investments — We gave minor credit for vendors with\nvendors will have to be competitive in this capability. Quality related investments, such as e-mail integration and native DLP\nindicators, such as the depth of the page-level categorization, capability. Native DLP capability shows technical prowess and\nthe real-time categorization of uncategorized sites and pages, can be useful in tactical situations; however, integration with\ndynamic risk analysis of uncategorized sites and pages, and the e-mail and/or dedicated DLP solutions is a more strategic\ncategorization of search results, were considered. feature.\nLeaders\n• Application control — Granular, policy-based control of Web-\nbased applications, such as instant messaging (IM), multiplayer Leaders are high-momentum vendors (based on sales and “mind\ngames, Web storage, wikis, peer-to-peer (P2P), public voice share” growth) with emerging track records in Web gateway\nsecurity, as well as vision and business investments that indicate\nthey are well-positioned for the future. Leaders do not necessarily\nTable 2. Completeness of Vision Evaluation Criteria\noffer the best products for every customer project; however, they\nEvaluation Criteria Weighting provide solutions that offer relatively lower risk.\nMarket Understanding High\nChallengers\nMarketing Strategy No rating Challengers are established vendors that offer SWG products but\ndo not yet offer strongly differentiated products, or their products\nSales Strategy No rating are in the early stages of development/deployment. Challenger\nproducts perform well for a significant market segment, but may\nOffering (Product) Strategy High not show feature richness or particular innovation. Buyers of\nchallenger products typically have less-complex requirements and/\nBusiness Model No rating\nor are motivated by strategic relationships with these vendors\nrather than requirements.\nVertical/Industry Strategy No rating\nInnovation High Visionaries\nVisionaries are distinguished by technical and/or product\nGeographic Strategy No rating\ninnovation, but have not yet achieved the record of execution in the\nSource: Gartner (January 2010) SWG market to give them the high visibility of the leaders or those\nthat lack the corporate resources of challengers. Expect state-of-", "5": "5\nthe-art technology from the visionary vendors, but buyers should be filters, the Web Security Service performs numerous advanced\nwary of a strategic reliance on these vendors and should monitor security checks, including page analysis, URL reputation,\nthe vendors’ viability closely. Given the maturity of this market, exploit kit detection, JavaScript analysis and bot detection.\nvisionaries represent good acquisition candidates. Challengers URL filtering is driven by the Barracuda database as well as\nthat may have neglected technology innovation and/or vendors in dynamic filtering for uncategorized sites. Advanced options\nrelated markets are likely buyers of visionary vendors. Thus, these include coaching and password-protected bypass with custom\nvendors represent a slightly higher risk of business disruptions. blocking pages for each rule. The solution also allows quotas\nbased on connection bytes and time limits. Application control\nNiche Players includes several dozen named applications in four categories:\nbrowsers, IM, P2P file sharing, and streaming media that are\nNiche player products typically are solid solutions for one of the\nbased on request and response headers and traffic signatures.\nthree primary SWG requirements — URL filtering, malware and\nThey also offer some options for Web browser control. The DLP\napplication control — but they lack comprehensive features\ncapability includes five static DLP libraries/lexicons and Secure\nof visionaries and the market presence or resources of the\nSockets Layer (SSL) scanning by category\nchallengers. Customers that are aligned with the focus of a niche\nvendor often find such provider offerings to be “best-of-need”\nsolutions. • Redirecting traffic to the Barracuda Purewire service is enabled\nwith an optional on-premises caching appliance (hardware or\nvirtual software) that caches traffic and provides for on-premises\nVendor Strengths and Cautions\nauthentication, Microsoft Internet Security and Acceleration (ISA)\nBarracuda Networks plug-in, and a variety of direct connect and Active Directory\nconfigurations. The Barracuda Purewire Web Security Service\nBarracuda Networks offers a range of inexpensive proxy-based\nalso offers a tamper-proof software client for roaming laptop\nappliances that leverage open-source technologies and enjoys\nusers that enforces remote/roaming traffic through a cloud\nhigh mind share in the SMB market due to extensive marketing\nservice.\nand an effective sales channel. It continues to experience solid\nglobal growth, primarily with customers that have less than 1,000\nseats. Barracuda recently acquired stSartup SeAcaaS SWMG providePr CLautionEs\nPurewire, and the company plans on using Purewire as a base for\nan expanded set of SecaaS offerings. Barracuda’s solid growth and • The Barracuda Web Filter appliance lacks enterprise-class\nthe acquisition of Purewire helped its execution score, moving it up administration and reporting capabilities. Advanced ad hoc\ninto Challenger status this year. Barracuda Web Filter appliances reporting features are lacking, and custom reports are limited\nare a good shortlist inclusion for SMBs looking for “set and forget” to filter settings on existing reports. The dashboard is not\nfunctionality at a reasonable price. The Barracuda (Purewire) customizable. It offers only a single administration account\nSecaaS offering is also reasonable in supported geographies. and does not support role-based administration. Some policy\nfeatures, such as file-type blocking, are very manual rather than\nStrengths menu-driven, and the overall workflow is feature-based instead\nof task-based. The appliance can only store six months of\ndata; longer-term data storage or aggregated reporting across\n• The Barracuda Web Filter’s Web graphical user interface\nmultiple boxes requires the Barracuda Control Center. Security\n(GUI) is basic and designed for ease of use. Deployment is\nthreat reporting does not provide any guidance on the severity\nsimplified with all settings in a single page with easily accessible\nof a particular threat, nor does it provide links to more detail on\nsuggested configuration settings and contextual help. The\nthe threats.\ndashboard includes a summary of top reports, including\ninfection activity, hyperlinked to the detailed reports. Real-time\nlog information can be filtered by a number of parameters • Barracuda relies heavily on open-source databases for URL\nfor easy troubleshooting. Malware protection is provided by and antivirus filtering (Clam AntiVirus) supplemented with\nopen-source Clam AntiVirus, augmented with some in-house- Barracuda’s own research labs. However, Barracuda’s research\ndeveloped signatures. The management console includes labs have not earned a strong reputation in the industry.\noptional infection thresholds that can kick off alerts or launch a Barracuda added the security researchers from Purewire to its\nmalware removal tool. Application controls include a fair number roster; however, with the industry-standard antivirus vendors\nof IM networks, software updaters, media stores, remote struggling to keep up with the increasing volume of threats, it\ndesktop utilities, toolbars and Skype. The Barracuda Web Filter will have to invest in more research capability to continue to\nis one of the most economically priced solutions in this Magic improve.\nQuadrant, and annual updates are priced per appliance rather\nthan per seat.\n• Purewire was an emerging startup when it was acquired,\nand Barracuda management has an ambitious road map for\n• The Barracuda Web Security Service (formerly Purewire) offers a integration of the existing Barracuda backup service as well\nvery clean and well-organized policy and reporting interface that as building an expanding line of SecaaS offerings in several\nis simple and logical. Dashboard elements all offer a consistent markets. The Purewire service still needs to mature to compete\nhyperlinked drill down into three levels of increasingly granular against the more-established SecaaS vendors in this space.\ndata. All security protection methods are included in the base The management interface is missing some enterprise options,\nprice. In addition to using several signature and blacklist-based such as expansive role-based administration, customization", "6": "6\nof dashboard elements, quick links to tasks and full policy • Blue Coat is often one of the least-expensive URL-filtering\nadministration audit reporting. Security threat reporting would options. Its URL-filtering pricing model is based on a one-time\nbe improved with more information, such as severity, and perpetual license fee plus annual maintenance charges.\nmore-detailed information about specific threats. Reporting is\nvery basic and could be improved with more customization\n• Blue Coat’s SSL termination capabilities (via an optional card\noptions. Predeveloped reports are too narrow and lack a\non ProxySG) enable Blue Coat to terminate and decrypt SSL\nsingle management summary report on activity. Purewire\ncontent and hand it off (via ICAP) to third-party devices, such as\ndoes not offer a zero-client footprint option with transparent\nDLP scanners (Blue Coat partners with five DLP vendors), for\nauthentication.\nfurther analysis.\n• Purewire only has data centers in Atlanta, Oakland, California,\n• Blue Coat offers an endpoint agent (free of charge) that\nand London. Barracuda Networks has data centers supporting\nprovides URL-filtering support (and application acceleration) for\nits Barracuda Backup Service (launched in November 2008)\nmobile workers.\nin Detroit, the District of Columbia and London. The company\nneeds to invest in a global enforcement infrastructure and\nCautions\nsupport presence outside the U.S. to appeal to global\nenterprise customers.\n• Blue Coat is the only provider that requires antivirus processing\nBlue Coat Systems on a dedicated appliance. The ProxyAV continues to be a\nliability in the SMB market, where it adds costs and requires\nBlue Coat is one of the original proxy cache vendors, and has\nintegration with Blue Coat’s proxy appliance.\nmaintained a consistent dedicated focus on the demanding SWG\nmarket for large enterprise and service providers. Blue Coat,\nwith its Mach5 products, is also a major player in the enterprise • Blue Coat’s lack of a SecaaS offering is a liability, given the\nWAN optimization controller (WOC), which enables application rapid growth of the SecaaS market. In December 2009, Blue\nacceleration. The company fell back slightly in Completeness of Coat announced plans to enter the SecaaS market in 2010 with\nVision compared with its peers in thisS Magic AQuadranMt due to a Plack Lan inEternally developed service.\nof focus on real-time malware detection in the gateway and lack of\na SecaaS delivery solution. Blue Coat remains the overwhelming\n• Blue Coat offers limited real-time, on-box malware and URL\ninstalled base leader in the enterprise proxy market and continues\ncategorization technology. Blue Coat sends uncategorized\nto show up on the majority of large enterprise shortlists.\nURLs to its cloud-based WebPulse service for dynamic\ncategorization and for malware analysis. This cloud-based\nStrengths approach is a valid method for detecting many forms of\nmalware. However, the cloud approach limits Blue Coat’s\n• The ProxySG product is well-tested for scalability and ability to perform malware analysis on websites that\nperformance in the demanding large enterprise market, and require authenticated access (e.g., social networking sites).\nincludes numerous advanced proxy features, such as support Alternatively, real-time on-box malware analysis, offered by\nfor a long list of protocols, extensive authentication and several Blue Coat competitors, provides the advantage of\ndirectory integration options, raw policy scripting capabilities, analyzing content on-premises, which minimizes latency and\ncommand line interface in addition to a GUI, SSL decryption, provides better protection against targeted threats.\nsupport for ICAP, and centralized management and reporting.\nThe company has one of the largest development and support • Blue Coat cannot monitor all network traffic in its most\norganizations in this market. commonly deployed proxy mode, but it can be configured in\nother modes to monitor all traffic.\n• ProxySG supports nine URL-filtering databases, including its\nown, and four antivirus engines on its ProxyAV platforms — the • Although the management interface and reporting infrastructure\nmost options of any vendor in the market. is improving, smaller customers complain that it is still geared\ntoward larger enterprises with extensive networking experience.\n• In addition to signature scanning, ProxySG exploits a frequently\nupdated URL database (owned by Blue Coat) to detect known • Blue Coat lacks DLP capabilities on its ProxySG appliance,\nmalicious URLs, and has static policy triggers to validate or limit although it can integrate via the ICAP protocol with a range of\nactive content (for example, ActiveX Controls or Java Applets) third-party DLP solutions.\nas well as limited active code analysis to detect unknown\nmalware.\nCA\nCA’s proxy-based SWG product, WebFilter Proxy, is a component\n• Blue Coat maintains URL database freshness and relevance\nof CA Gateway Security, which includes e-mail security and\nby automatically sending unclassified URLs to one of five data\nprovides a common management interface, as well as policy and\ncenters “in the cloud” for categorization and malware detection.\nreporting for Web and e-mail gateways. The CA WebFilter is a\npossible shortlist inclusion for SMBs looking for a suite solution that\nincludes e-mail protection.", "7": "7\nStrengths • URL filtering could benefit from more-advanced options, such\nas a coaching option, and bandwidth control or quality of\nservice. Application blocking is URL-based or port blocking,\n• The Web and e-mail software appliances can be bundled\nand is not menu-driven.\ntogether for smaller organizations or physically separated for\nlarger organizations.\n• The proxy does not support SSL termination or ICAP, which\nlimits its DLP capabilities (it cannot hand off SSL-encrypted\n• Malware detection is provided by the CA anti-malware\ncontent to a DLP sensor). Inbound and outbound malware\ndatabase team, which is one of the larger malware research\ncan evade detection by port/protocol hopping or tunneling in\norganizations.\nHTTP/S.\n• URL filtering is provided using the McAfee database. It has\n• The proxy does not support native FTP.\nsome advanced features, such as self-authorization, time-based\npolicy elements and basic application control based on URL\nclassification. • CA offers only software for Microsoft platforms, so it will\nbe hard-pressed to match the ease of use of purpose-built\nappliances. Support and cost of the underlying Windows\n• The WebFilter has strong native DLP capability for a SWG,\nhardware and software should factor into the total cost of\nincluding the ability to parse some document files for content\nownership calculation.\nchecking, keyword dictionaries, regular expression matching\nand file binary detection.\nCisco\nIronPort (a Cisco-owned company) designed its S-Series\n• The management interface supports the broadest number of\nproxy/cache from the ground up to address the multifunction\nlanguages (10).\nrequirements of a modern SWG and the scalability needs of\ndemanding large enterprise customers. The S-Series appliance\n• CA Gateway Security is very reasoSnably pAriced. MP isL rapidlyE maturing and experiencing very solid growth in the\nlarger enterprise proxy/cache market. Cisco recently acquired the\n• CA Gateway Security can be installed as a plug-in to pioneering SWG SecaaS company ScanSafe. ScanSafe continues\nMicrosoft’s ISA Server (proxy and multifunction platform). to execute well and has the largest market share in the SecaaS\nmarket including several organizations with well more than 100,000\nseats. ScanSafe is expected to form the basis of an increasing\nCautions\narray of Cisco SecaaS offerings, starting with the addition of\ne-mail. Cisco’s credibility with the network operations team, the\n• Malware detection is provided by the same signatures as for progressive development and market growth of the S-Series\ne-mail and end nodes (different signatures at the SWG and and the acquisition of the leading SecaaS provider moved Cisco\nat the desktop enhances security) and advanced, real-time into the Leaders quadrant this year. Cisco/IronPort S-series is a\nthreat detection is very limited. Indeed, CA’s position is that the strong shortlist inclusion for large enterprise customers, while the\n“gateway” is the wrong place to combat spyware. ScanSafe solution is strong for any enterprise size. The eventual\nintegration of these two will make a powerful hybrid combination.\n• Some customers reported that the Gateway Security\nmanagement console was difficult to use, with numerous Strengths\napplications and pop-up windows. Policy development\nis difficult to troubleshoot without an audit summary.\n• The S-Series provides good on-box malware detection. It\nAdministrators or auditors must restep through the policy\nprovides parallel scanning capabilities across multiple verdict\ndevelopment process to spot errors or troubleshoot.\nengines for inbound as well as outbound security and content\nscanning. Signature databases are offered from Webroot\n• The real-time graphical dashboard is weak, with a limited log and McAfee, and can be run simultaneously. Non-signature-\nview and some server statistics only. The reporting tool is based detection includes exploit filters that proactively examine\nrequired to view details; however, the dashboard is not linked page content, site reputation, bot network traffic detection,\nto the reporter with any hotlinks. Administrators must open transaction rules and Cisco-generated threat center rules. It\nthe reporting tool, “Reporter,” and find the relevant report. also uses a mirroring port (SPAN port) network interface card\nReports are very basic, and there are only a limited number of for out-of-band traffic analysis to detect evasive outbound\npredeveloped reports. Included reports are not comprehensive, phone-home traffic or application traffic. The S-Series is one of\nalthough it does also include a customizable report generator to the few products that includes a full native FTP proxy and SSL\ncreate customizable reports. Report scheduling is provided by traffic decryption.\nyet another application utility.\n• Cisco/IronPort’s URL categorization engine is augmented\n• Although the dashboard has outbound malware statistics, with a dynamic classification engine for unclassified sites and\ndetails are buried in a custom report and actions are limited. user-generated content. The S-Series also offers application\nThe ability to isolate and repair infected clients is lacking. control using application signatures to identity and block/allow", "8": "8\na large collection of Web-based applications, including Skype secure e-mail gateway appliances, although policy can be\nand popular IM applications. The S-Series provides good DLP manually exported from the e-mail gateway and imported to the\nfunctionality with the combination of integrated on-box Data S-Series.\nSecurity Policies and the choice of advanced DLP content\nscanning through ICAP interoperability with third-party DLP\n• The S-Series is one of the more expensive SWG appliances in\nsolution RSA and Symantec/Vontu. Policy options include the\nthe market, and Cisco charges extra for the SenderBase Web\nability to block “posting” to Web 2.0 type sites.\nreputation filter.\n• IronPort has numerous features to enhance the scalability of the\n• S-Series reporting is improving; however, it is still a weak spot.\nS-Series for demanding large enterprise needs including native\nThere is no ability to customize the on-box dashboards, nor is\nActive-Active clustering, centralized management for up to 150\nit always possible to drill down into detailed off-box (Sawmill)\nservers per management server, appliances that can support up\nreporting from top-level dashboards. Per-user reports and\nto 1.8 terabytes of storage with hot-swappable, Serial Attached\nforensic investigative reporting are weak. The appliances\nSCSI (SAS) drives and RAID 10 configuration and RAID1\ncan store 30 days of on-box log data, but they offer limited\nmirroring, six 1Gb network interface as well as a fiber option. In\nreporting functionality. To generate reports from log data that\naddition, the security scanning is enhanced by stream scanning,\nis older than 30 days, users must export log data to a third-\nwhich enables scanning for larger or long-lived objects without\nparty log analysis and reporting package from Sawmill (requires\ncreating the bottlenecks associated with buffer-based scanning.\na Windows server). The Sawmill package is also required to\ngenerate detailed per-user statistics, even for on-box-stored\n• ScanSafe’s Web-based management interface is clean data. The M-series management server is the logical place for\nand simple to use, even for nontechnical users. Customers this reporting, and Cisco is expected to deliver this functionality\ncommented on the ease of deployment in migrating to the during the next 12 months.\nScanSafe service. The graphical dashboard is hyperlinked to\nfiltered log views. Near-real-time customized reporting was\n• ScanSafe’s early leadership position and lack of competition\nsignificantly improved in the latest version with data mining\nhas resulted in lethargic feature growth and innovation. It\ncapability. The service offers a reaSl-time cAlassificatMion serviceP Lis beEginning to change now that it is facing competition\nto classify unknown URLs into a small set of typically blocked\nfrom more-nimble startups; however, product features and\ncategories (for example, pornography or gambling). URL\nglobal presence should be better, given such an early lead in\nfiltering is enhanced with some advanced functionality, such\nthis market. We expect the infusion of Cisco resources will\nas bandwidth and time-based quotas, and a “search ahead”\nreinvigorate the company.\nfeature that decorates search engines with URL classification.\n• ScanSafe’s management interface is better suited for simple\n• ScanSafe offers simple outbound DLP functionality (dictionary\npolicy constructs. Setting up a policy may require multiple\nkeyword matching, named file detection and preconfigured\nsteps to implement a single rule. The policy is tied to specific\nnumber formats), and file hash matching can integrate with\nprotocols, and a troubleshooting policy is complicated by\nsome enterprise DLP vendors.\nlack of readable summaries. It does not have the capability to\ncreate a reporting role that only has access to specific group\nCautions\ndata. Outbound threat information is minimal, lacking severity\nindicators or detailed information about infections. For laptop\n• Cisco will face some cultural and product integration challenges users, it does not have a zero footprint authenticated client\nwith ScanSafe, including refocusing the sales and channel on solution. ScanSafe charges an extra fee for its Anywhere+\nservice selling, integrating the ScanSafe endpoint client with service (for roaming employees) and its IM Control service.\nCisco’s remote access/AnyConnectVPN client, and delivering Application control is limited and URL-based, rather than based\na unified IronPort/ScanSafe reporting and unified policy on network signature protocol. Like other services and proxy\nmanagement console, which Gartner estimates will require, at products, ScanSafe can only see outbound traffic in HTTP\nminimum, six months. traffic, and will miss evasive applications and malware.\nClearswift\n• The S-Series has a strong foundational design; however, it still\nneeds refinement of the management interface and is missing Clearswift is a veteran secure e-mail gateway vendor with a\nsome advanced features. It is clearly designed for larger high profile in EMEA. It has integrated its proxy-based SWG —\nenterprises with demanding network requirements but does Clearswift Web Appliance — with its e-mail security solution to\nnot scale down well for SMBs with simpler needs. Application provide cross-channel policy and consolidated reporting. Overall,\ncontrol is not well instrumented and requires administrators to Clearswift’s primary advantage is its integration with its e-mail\nunderstand the network behavior of some evasive applications solutions and the provision of DLP across both channels, making\nto build an effective policy. It does not provide bandwidth it a good choice for existing e-mail customers or EMEA buyers\nmanagement or QoS options. Application control and QoS are looking for both solutions from the same vendor.\nscheduled to be addressed in 1H10. It lacks the ability to block\ncertain functions in Web applications, such as Web mail and\nsocial networking. DLP is not yet integrated with the IronPort", "9": "9\nStrengths block based on the specific characteristics of the application\nfound in the HTTP content. It cannot filter or manage evasive\napplications, such as Skype.\n• Clearswift offers a clean, logical browser-based interface for\npolicy development that is easy to use, even for nontechnical\nusers. E-mail and the Web are managed in the same console. • It does not support in-line/bridge mode deployments, ICAP or\nMultiple devices can be managed from any machine. WCCP.\n• Policy development for DLP is very good and several policy • Pricing is very high relative to peers\nconstructs —Sarbanes-Oxley Act (SOX), Gramm-Leach-\nBliley Act (GLBA), Payment Card Industry (PCI) Data Security ContentKeeper Technologies\nStandard, Securities and Exchange Commission, accounting\nContentKeeper Technologies is based in Australia, where it has\nterms and stock market terms — are included. The same policy\nmany large government and commercial customers. It offers a\ncan apply to Web and e-mail, and it is possible to intercept and\nfamily of SWG appliances that deploy as an in-line bridge. The main\ncopy/archive Web mail and IM traffic that triggers DLP policy.\nfocus of the company is URL filtering, and the company maintains\nClearswift also provides strong policy audit and printable policy\nits own URL-filtering database. Signature-based antivirus protection\nsummaries for troubleshooting.\nis licensed from Kaspersky, and is available as an integrated\non-box offering. SecaaS-based e-mail security is available via an\n• Clearswift offers good reporting capability. All machines in a OEM partnership with Webroot. ContentKeeper is a good option\ncluster are capable of local or consolidated reporting. Reports for organizations looking for simpler URL filtering capability in\nare active and include a hyperlink drill-down of details. Malware supported geographies.\nfiltering is provided by Kaspersky and Sunbelt Software. It is\naugmented with some in-house, preconfigured, policy-based Strengths\ncode analysis. The Clearswift Web Appliance is capable\nof SSL certificate validation, decryption and inspection.\nURL categorization is provided by the RuleSpace database • ContentKeeper offers a series of five appliances, the largest\nSAMPLE\naugmented by real-time dynamic classification of uncategorized of which is based on IBM blade server technology, which the\nsites. company claims has a maximum throughput rate of 14 Gbps.\nThe appliances “fail open” due to a high-availability hardware\nmodule. In addition to supporting in-line bridge mode, the\n• Clearswift offers a good array of form factors including a appliances also proxy SSL traffic and provide decryption\ndedicated hardware appliance, soft appliance for installation on capabilities. IPS capabilities are provided via Snort signatures.\nany hardware, or as a virtual appliance for VMware, and has\nnative ability to “peer” a cluster of appliances together.\n• The Advanced Reporting Module (ARM) is an optional solution\nthat provides good graphical analysis of log information,\nCautions\nincluding the option to display data in bar and pie charts.\nThe ContentKeeper appliances can be set to export data to\n• Clearswift remains an EMEA brand and does not enjoy the ARM in real time or on a periodic basis. The ARM may\nsignificant brand recognition in North America. Its market share be deployed on the ContentKeeper appliance or off-box.\nin the SWG market is very small. Real-time monitoring and alerting are achieved through the\nContentKeeper Monitor package. ContentKeeper provides\nstrong bandwidth control capabilities. It provides bandwidth\n• Malware detection is primarily limited to signatures and only\nquotas and QoS features.\nin HTTP/S traffic. It does not include out-of-band malware\ndetection, and reporting is missing detailed threat information or\nseverity indicators. The solution cannot isolate or clean infected • All ContentKeeper appliances maintain a feedback loop with\nmachines. the ContentKeeper data center. On an hourly basis, the Web-\nonly appliances receive updates to the URL database, and they\nsend any unclassified URLs to the data center for analysis and\n• Enterprise management features such as group-level\nclassification. ContentKeeper appliances with the integrated\nadministration and reporting, customizable dashboards and log\nantivirus support call in for updates every five minutes. The\nfile searching are lacking. Centralized management is limited to\nfeedback loop is supplemented with URLs obtained via Web\nsupporting nine local boxes.\ncrawling techniques, and suspicious sites are further analyzed\nfor malware.\n• Application control is limited to blocking URL destinations (and/\nor streaming protocols) and file-type blocking. It is possible\n• ContentKeeper provides application control for more than 90\nto detect and block specific applications, but it requires the\napplications.\ncreation of custom rules within the appliance to identify and", "10": "10\n• ContentKeeper offers one of the most cost-effective URL- applications. Bandwidth shaping can be performed at a broad\nfiltering solutions in the market. level for virtual LANs, IP ranges, and Active Director Groups, or\nat a very precise level down to specific Host MAC or IP address,\nCautions Web category, specific URL, file type, mime type and user.\n• ContentKeeper has a weak presence in Europe and North • The Network Composer includes more than 650 application\nAmerica (more than 50% of its sales are in the Asia/Pacific signatures that can be used to build network policies for\nregion). blocking or allowing applications. Applications can also be\nprioritized in terms of relative importance, using the bandwidth\ncontrol capabilities described.\n• Malware detection and control is limited. Only one option\n(Kaspersky) is offered for on-box signature-based malware\nprotection. Outbound malware detection lacks detail. It shows • Cymphonix offers a series of seven appliances, the largest of\nwhich malware infected websites have been blocked, but which the company claims has a maximum throughput rate of\n— unlike some other solutions — does not contain severity 200 Mbps. The appliances can be configured to “fail open.” In\nindicators or detailed information about infections. addition to supporting the in-line bridge mode, the appliances\nalso proxy SSL traffic and provide decryption capabilities.\nCymphonix also offers a useful free network utility that enables\n• The SecaaS offering, which is primarily targeted at SMBs,\norganizations to identify rogue and bandwidth hogging\nlacks several enterprise-class capabilities. User authentication\napplication traffic on their networks.\nand traffic forwarding (to the cloud) requires an agent on\nevery endpoint (several SecaaS providers offer integration\nwith domain controllers to avoid endpoint software). The SWG • The Web GUI is simple and easy to use, and the reporting\nSecaaS offering provides limited application control and does capability is good. Tabs provide easy navigation to a collection\nnot offer real-time malware detection. of reports that can be modified, saved and scheduled, and\nreports provide hyperlink drill-downs that show more details.\nPolicy management is easy to use, and includes numerous\n• On-box reporting via the Monitor SpackageA and hyMperlinks to Pthe LadvaEnced functions to combine application-shaping and\nARM for drill-down analysis needs improvement. ContentKeeper\ncontent-control policies to individuals or groups.\nhas plans to introduce an enhanced GUI in 2010.\n• In 2009, Cymphonix strengthened its reseller channel program\n• Uncategorized URLs are not classified in real time. Updates to\nand expanded into EMEA and Asia/Pacific.\nthe ContentKeeper appliances are dependent on configurable\ncall-in parameters (one hour for Web-only appliances and five\nCautions\nminutes for Web and antivirus appliances). The URL database\nneeds more granularity. It only supports 32 categories; most\ncompetitors support more than twice as many categories • Although Gartner believes that Cymphonix is growing faster\n(although custom categories can be added). than the SWG market, it remains one of the smallest vendors in\nthis Magic Quadrant and still has low market share and brand\nCymphonix recognition.\nCymphonix, a privately held Utah-based company, was founded\nin 2004. The Cymphonix Network Composer is an appliance- • There is no centralized reporting/management interface for\nbased product that is mostly deployed as an in-line transparent managing clusters or geographically dispersed gateways; one is\nbridge, but it can also be deployed as a proxy. Cymphonix licenses scheduled for release in 1Q10.\nmalware signatures from Sunbelt and Clam AntiVirus. The URL-\nfiltering database is licensed from Rulespace and is enhanced\n• Some customers have complained about Cymphonix’s licensing\nthrough internally maintained updates. Cymphonix is a good fit\nmodel, which is based on IP addresses and not users. With the\nfor SMBs looking for a single SWG with advanced bandwidth\naddress-based model, printers, IP phones and non-browser-\nmanagement capabilities at a reasonable price. Its ability to detect\nbased devices must be manually identified and placed in an\nand block proxy anonymizers (used to bypass URL filtering) makes\n“exception list” so that they are not counted.\nit a good fit for the K-12 education environment.\n• Some customers reported excessive miscategorizations of\nStrengths\nURLs, although the 8.7 release in September 2009 replaced\nthe categorization engine with the RuleSpace engine, which has\n• Cymphonix offers one of the strongest bandwidth control less reliance on dynamic classification.\ncapabilities in the SWG market. Its bandwidth-shaping policies\ncan be nested within one another for more granular control. For\n• There are no DLP capabilities or related e-mail protection\nexample, users in a particular role can be assigned a maximum\nproducts.\nof 30% of available bandwidth for an Internet connection. This\ngroup can be further shaped, so that 10% of its bandwidth\nis assigned to IM, while 70% is reserved for mission-critical • There is no support for ICAP or WCCP.", "11": "11\nFaceTime Communications • Multiple USGs can be clustered to share a database, which\nthen allows for a shared repository of configuration and\nFaceTime, a privately held company based in California, started in\nreporting for multiple geographically dispersed USGs.\nthe IM security market and has branched out into the broader SWG\nmarket. The company’s installed base includes a significant number\nof large enterprise businesses, primarily in North America. These • Customers can choose between two URL-filtering databases.\ninclude many financial institutions, which were the primary buyers FaceTime’s URL-filtering policy is average, but includes some\nof IM security solutions. It has its own malware and application advanced features, such as a coaching option for soft blocking.\nresearch capabilities, and the deepest visibility and controls for Web\n2.0 type Internet applications. FaceTime’s Unified Security Gateway Cautions\n(USG) appliance can be deployed by connecting to a SPAN/mirror\nport and in-line, and can also interface to proxies via the ICAP\n• FaceTime’s biggest challenge is improving its visibility and\nprotocol. When deployed in-line, the USG can proxy HTTP/S and\nmind share against increasingly larger and more-strategic\ntraffic from common IM and enterprise unified communications (UC)\ncompetition. It needs to rapidly expand its channel partners and\nservices. FaceTime is a strong choice for organizations looking for\nits client base, because it is at risk of becoming a niche provider\nfine-grained Web application controls.\nin the financial services market.\nStrengths\n• FaceTime’s URL-filtering capabilities do not offer the ability to\ndynamically classify uncategorized websites, and URL-filtering\n• FaceTime revised its management interface during the past\nupdates are only provided daily (many vendors provide hourly\n12 months, and the resulting Version 3.0 has a significantly\nor subhourly updates). DLP keyword filtering capability can be\nimproved dashboard and reporting capability, as well as a more\nused to classify pages, but this capability is not predefined,\nflexible and scalable object-based policy engine. The dashboard\nand users would have to create and fine-tune their own\nis fully customizable, and administrators can create their own\ncategorization policies. There is no integrated URL client for\nlook and feel, adding virtually any report as a dashboard\nmobile employees and no SecaaS solution.\nelement. All dashboard elements are hyperlinked to reports\nand log data detail. V3.0 also offeSrs a uniqAue fully McustomizabPle LE\n“Heatmap” dashboard element that enables administrators to • FaceTime relies on signature engines for malware and has\nvisualize traffic and events rapidly. limited on-box ability to dynamically inspect Web pages for\nmalicious intent.\n• FaceTime has the deepest visibility and controls for Internet\napplications, with more than 4,000 named applications, • FaceTime does not cache content and does not offer\nincluding IM, P2P, anonymizers, IP television, gaming software, bandwidth QoS options to improve the performance of priority\nmultimedia, remote administration tools, virtual worlds, VoIP, applications.\nWeb-based IM and Web conferencing. In particular, FaceTime\noffers the strongest control for Skype. A special plug-in to the M86 Security\nUSG appliance enables it to detect and block malicious URLs\nM86 Security is a newly formed company comprised of these four\nwithin Skype IMs.\ncompanies, all of which were independent as of October 2008:\n• FaceTime continues to leverage its 2005 acquisition of XBlock\n• Marshal — E-mail and SWG solutions for the SMB market.\nSystems for a malware-filtering database, as well as an optional\nMarshal’s solutions are deployed as software or as appliances,\nSunbelt software malware database and a Web antivirus\nand can function as a proxy or can be integrated with\ndatabase from Sophos. USG also offers some behavior-based\nMicrosoft’s ISA Server.\ndetection techniques. Reporting on inbound and outbound\nthreats is very strong and includes the specific detailed\ninformation on the malware (for example, name, threat rating • 8e6 — URL filtering for the K-12 and large enterprise market.\nand more) and links to FaceTime’s Web-based reference site, The 8e6 solution is deployed as an out-of-band appliance\nspywareguide.com. attached to a “mirrored” port on a LAN switch.\n• FaceTime offers good DLP and archiving capabilities for IM • Avinti — Behavioral malware detection for e-mail security (M86\ntraffic and HTTP/S traffic (e.g., Web mail and blog posts). is now also applying the technology to analyze Web threats).\nFor example, policies can be enabled to control and log all\noutbound content for blog posts to social networking sites and\n• Finjan — Proxy-based SWG with real-time code analysis\nalso for Web mail traffic. Policy options include taking a screen\ntechnology for detecting Web-based malware. Finjan has a\nshot of the Web page for which DLP policy is triggered. The\nbroad mix of customers (SMB and large enterprises) in EMEA\nlogging can also be triggered by lexicon match (for example,\nand a more focused group of large enterprise customers in the\nlog all credit card numbers posted to a social networking site).\nU.S.\nDLP capabilities can also be exploited for dynamic content-level\nblocking of offensive text content.", "12": "12\nIn November 2008, Marshal merged with 8e6 to become Cautions\nMarshal8e6. In April 2009, Marshal8e6 acquired Avinti, and in\nSeptember it renamed itself M86 Security. In November 2009, M86\n• M86’s overall strategy will be challenging to execute. It will\nannounced its acquisition of Finjan. M86’s strategy of acquiring\nbe difficult to compete in multiple market segments while\ngood malware detection technology, particularly Finjan, helped\nintegrating the technology from four different development\nit earn Visionary status, although as we note, it faces challenges\nteams into a cohesive product, with a unified management\naround product integration and cross-selling its solutions into new\ninterface, while competing against the market leaders. M86\nmarkets. The Finjan offering is M86’s strongest enterprise SWG\nnow consists of four previously independent companies with a\nsolution, and is a good shortlist inclusion for security-conscious\ncombined customer base of companies ranging from SMBs to\norganizations.\nvery large enterprises. M86’s plans to grow its large enterprise\nbusiness and to also maintain a strong SMB presence\nStrengths\nrepresents a difficult sales, marketing and product management\nchallenge.\n• Through its mergers and acquisitions, M86 owns a broad base\nof SWG and secure e-mail gateway technologies. Marshal’s\n• In addition to the product integration challenges, M86 has plans\nhistoric product focus was in the SMB e-mail security market,\nto introduce SecaaS services, for e-mail and SWG. The e-mail\nand it also was an early entrant in the SWG market. 8e6\nSecaaS market is already mature, and the SWG SecaaS market\nwas a “pure-play” URL-filtering appliance vendor with solid\nis highly competitive and will mature quickly. Time to market is a\nperformance and reporting capabilities for the K-12 market\nserious issue.\nand for large enterprises. The acquisition of Avinti provided\ntechnology for runtime code analysis to detect malware. The\nFinjan acquisition gives M86 strong content analysis security • Finjan’s on-box reporting is very basic and requires Windows\ntechnology in a proxy-based appliance. Finjan has been a and SQL database licenses for the reporting server. Larger\npioneer in real-time code analysis technology, which scans enterprises that require long-term storage and consolidated\na broad array of Web programming languages (for example, reporting will find the on-box reporting limited. In 2010, M86\nHTML, JavaScript, VBScript and Java) for malicious intent. M86 plans to utilize Linux-based technology that it acquired from 8e6\nhas moved quickly to provide somS e basicA integratM ion acrossP Lfor itEs SWG reporting server.\nthe Marshal, 8e6 and Avinti products, by correlating threat\ninformation between its e-mail and Web solutions. McAfee\nMcAfee moves into the Leaders quadrant this year with the\n• The Finjan acquisition should progress relatively smoothly, acquisition of Secure Computing. The McAfee Web Gateway\nsince the CEO of M86 was previously the CEO of Finjan. Other (MWG) is the new name for the Secure Computing Secure\nexecutives have also worked at both companies, which should Web Gateway, which Secure acquired from CyberGuard, which\naccelerate the process of forming a unified corporate culture. purchased Webwasher. It is now McAfee’s flagship Web gateway\nappliances, although McAfee will continue to support its legacy\ne-mail and Web Security Appliance product primarily for SMB\n• Finjan provides strong real-time malware filtering based on\ncustomers. This analysis focuses entirely on the flagship MWG\ncontent inspection, good application control and some DLP\nproduct, which remains a solid choice for many enterprise buyers,\ncapability in a proxy-based scalable appliance. Finjan has a\nespecially those that are already McAfee ePolicy Orchestrator (ePO)\ngood installed base in large security-focused organizations. The\nusers.\nFinjan product is the strongest enterprise-class SWG solution\nin M86’s product family and will serve as the platform for\nStrengths\nintegrating M86’s newly acquired technologies. Marshal offers\nsecure e-mail gateways and an SWG solution in software and\nappliance form factors. It has several strengths as a stand- • The MWG Ajax/Web-based management interface is well-\nalone SMB-focused solution, including a strong management organized, easy to navigate and deploy for technical users,\ninterface, reusable policy elements and good DLP support for and offers numerous advanced management features such\nmultiple signature-based malware scanning engines. as granular role-based administration, data anonymization,\nFTP command filtering, object-oriented policy, native\ncentralized management and user quotas. MWG is gradually\n• 8e6 solution has several strengths as a stand-alone URL\nbeing integrated with McAfee’s ePolicy ePO management\nfiltering solution, particularly for real-time reporting and alerting\nplatform. MWG has a reporting application that offers tiered\nof Internet usage, although this capability requires the Threat\nadministration and ships with enterprise version of MySQL or\nAnalysis Reporter appliance and the Enterprise Reporter\nintegrates with Microsoft SQL or an Oracle Database.\nappliance to provide log analysis. It’s URL filtering appliances\nare positioned out of band, so they install easily and do not\nrequire integration with proxy caches or firewalls (although, • MWG has strong on-box malware protection with a choice of\nas an independent solution, 8e6 does not provide adequate Avira or McAfee’s signature engine, as well as some zero-day\nmalware protection). security technology, which includes real-time code analysis\ntechnology that scans a broad array of Web programming\nlanguages for malicious intent. The URL categorization engine is\naugmented with its own TrustedSource URL reputation data.", "13": "13\n• McAfee has a solid antivirus research team and data feeds from Optenet\nits TrustedSource reputation system, which has been expanded\nOptenet, a new entrant into this Magic Quadrant, is a private\nto cover URLs clear.\ncompany spun out of the University of Navarra’s School of\nEngineering in San Sebastian, Spain. The company is the only one\n• MWG includes several advanced URL-filtering policy features, in this Magic Quadrant that offers a product-based, multitenant\nsuch as progressive lockout, which senses multiple bad URL (i.e., enables service delivery to multiple customers using shared\nrequests and locks out Internet access. Bandwidth quotas, infrastructure) SWG and e-mail infrastructure solution (Note that\ncoaching and soft blocking are also available. SecaaS vendors all offer multitenancy). It is primarily aimed at\ncarriers, managed security service provider (MSSPs) and large\nenterprises that want to create SecaaS service offerings for their\n• The product includes SSL decryption, which will combine\nown clients. Optenet is a strong shortlist contender for large\nwell with McAfee’s strong native DLP capability. Management\norganizations and service providers planning on delivering a\nintegration with e-mail security will provide a benefit, especially\nmultitennancy SecaaS-type solution.\nwith DLP administration.\nStrengths\n• In addition to its appliance-based offerings, McAfee has\nrelaunched Secure computing SecaaS Web Protection Service\n• Optenet’s recently launched Ajax-based dashboard and\nand ported MWG to the McAfee Content Security Blade Server\nmanagement interface is the same for Web and e-mail\narchitecture to meet large enterprise/ISP needs. McAfee also\nsolutions. It is very customizable, enabling users to add different\nrecently acquired MXLogic, which offers e-mail and Web\nreports in numerous combinations. Hyperlink drill-downs allow\nsecurity; however, we expect the Secure Computing SecaaS\nfast movement form the dashboard into active reports and log\nplatform to replace the MX logic Web filtering infrastructure.\ndata. Most report elements can be right-clicked for context-\naware options. Role-based management includes four roles.\nCautions\nPolicy auditing and policy review capabilities are very good.\nOptenet also offers a command line interface and direct policy\n• McAfee still has lots of integration Swork toA do to inMtegrate witPh LscripEt editing for more-proficient users.\nePO and its DLP, e-mail and endpoint solutions to deliver the\nsecurity and deployment advantages of a single solution.\n• The solution can be deployed in bridge and proxy/cache\nmode or WCCP and ICAP, and provides malware filtering\n• Long-term McAfee customers have suffered from very for HTTP, FTP HTTPS POP SMTP and MMS on a variety of\ninconsistent support experiences throughout mergers. It will platforms, including crossbeam and Linux (Red Hat), as well as\ntake time for McAfee support to gain enough experience to offer appliances.\na good support experience. Premium support is recommended.\n• Optenet augments Kaspersky, Sophos and Snort Signatures,\n• Management features are still maturing, and customer with its own security analysis for emerging threats. Outbound\nreferences indicate that product documentation is lacking. threat reporting includes a severity indicator in a graphical\nSome commands can only be executed via a command line format.\ninterface, the dashboard cannot be customized; it lacks a raw\nlog search capability, the policy change audit log is very basic,\n• Application control includes numerous named applications\nand the solution lacks the ability to review policy in a single\ndetected via network signature detection. The solution also\npage. Some changes require a server reboot.\noffers bandwidth management and QoS features, as well as\na good network analyzer that provides network application\n• Outbound malware reporting is still absent on the dashboard visibility.\nin any detail, and reports do not include severity indicators,\ntrending information, or quick links to detailed threat information\n• URL filtering is provided with its own URL database augmented\nor automated remediation.\nby a dynamic categorization engine. SSL decryption enables\ndynamic classification of encrypted content. Spanish URL\n• Consolidated and advanced reporting functions require the categorization, in particular, is strong. It also has an image\nWeb reporting product, which is a separate application with a analyzer for pornography detection.\ndifferent look and feel from the management interface, and it\ndoes not have hyperlinks from the dashboard logs or reports\n• Optenet is very attractively priced.\non the appliance. The basic Web Reporter version is included\nwith the appliance; however, the Premium version is required\nfor advanced features, such as delegated administration and\nad hoc reporting. The number of canned reports is low, and\nsome reports do not have obvious features, such as pie graph\noptions. Some customers complained about the scalability of\nthe reporting interface.", "14": "14\nCautions • Application controls are above average and include an extensive\nlist (more than 450) of potentially unwanted applications. It\nalso supports blocking of IM file attachments and enforcing\n• Optenet’s client base is primarily centered in southern Europe,\nacceptable browser types. eSafe provides basic DLP protection\nand it has little brand recognition or presence in other markets.\nwith consistent policies across e-mail and Web traffic. It\nIt has an office in the U.S., and is aggressively planning\ncan monitor, log and alert on files attempting to leave the\nexpansion. Although the company has numerous small\norganization, and it supports archiving of outbound content for\nenterprise customers, the solution is designed primarily for the\nforensic purposes.\nneeds of telecoms and large enterprises.\nCautions\n• Options for redirecting mobile clients to the service are very\nlimited, and a globally roaming user is not always automatically\n• eSafe continues to struggle with brand awareness, especially\ndirected to the nearest available data center.\nin North America and overall with its SWG product mind share,\nand growth is slower than the overall market. Safenet’s strategy\n• The inclusion of some firewall and IPS-specific configuration in of combining the eSafe SWG with encryption and identity and\nthe management policy can cause some confusion. access management (IAM) is embryonic, and although these\nare some of the components of a enterprise data security\nprogram, very few enterprises currently consider these domains\n• Application control does not include any ability to block specific\ntogether when making purchasing decisions. eSafe lacks many\nfeatures.\nenterprise-class DLP features.\n• The outbound security reporting does not include any\n• Despite significant improvements in the management interface\ninformation type of threats or any detailed threat information.\nand reporting engine, some enterprise features are still lacking.\nThe dashboard is not customizable, and with the volume of\n• The solution does not include any DLP capability. reports available, it would be beneficial to have a “favorites”\nSAMPLtab. EPolicy creation is not object-oriented and will be difficult to\nSafeNet scale for organizations with numerous policy exceptions. The\neSafe products lack bandwidth control capabilities, such as\nIn March 2009, SafeNet and Aladdin merged under common\nenforcing bandwidth utilization policies. Policies for establishing\nmanagement as a result of Aladdin’s acquisition by Vector Capital\ntime usage quotas are limited and there is no coaching or soft-\n(SafeNet’s private equity owner). Aladdin was better known for its\nblocking capability. Outbound malware reporting is weak, the\nidentity token business, but it was an early entrant in the SWG market.\ndashboard has no outbound threat information and predefined\nThe eSafe Web Security Gateway solution is now part of SafeNet’s\nreports lack severity indicators or detail that would aid in\nEnterprise Data Protection (EDP) strategy, which combines encryption\nremediation. eSafe does not provided dynamic classification of\nand multifactor authentication with the SWG and its native DLP\nuncategorized URLs in real time.\ncapability. Aladdin had a good cross-section of enterprise customers\nmostly in EMEA, and also had a presence in North America and the\nAsia/Pacific region. Its growth rate stalled by our analysis in 2008, Symantec\nbringing down its execution score. eSafe is a reasonable shortlist Symantec entered the SWG market in 2009 with two major\ninclusion for midmarket enterprises in supported geographies. acquisitions. The company acquired SWG and e-mail security\nSecaaS provider MessageLabs (October 2008) and appliance\nStrengths provider Mi5 Networks (April 2009). Mi5 is now a part of the\nSymantec Enterprise Security Group and has been relaunched as\nthe Symantec Secure Web Gateway (SSWG). MessageLabs is a\n• eSafe has significantly improved its dashboard, reporting and\ngood shortlist inclusion for customers looking for a simple-to-use,\nmanagement interface from last year focusing on midmarket\nservice-based solution, especially if they are also interested in\nneeds for lower administration. The dashboard has extensive\ne-mail security services — especially existing MessageLabs e-mail\ninformation in a graphical format with hyperlinked drill-down into\nsecurity clients. SSWG is a good shortlist inclusion for customers\ndetailed report information. The reporting engine was improved\nlooking for a scalable, in-line appliance SWG or those looking to\nwith more than 240 predefined reports, including graphical end-\naugment their existing proxy cache solutions with better security\nuser activity reports. Incident and forensic analysis is easy with\nand application control.\nstrong log file search functionality with drop-down picklists of\npotential search terms.\nStrengths\n• Aladdin’s heritage as an antivirus company shows in its\nstrong malware filtering capabilities, which includes in-memory • MessageLabs is one of the leading SecaaS secure e-mail\ncode emulation for analyzing suspicious code, vulnerability gateway vendors, and its Web GUI has the same simple and\nshielding, script analysis, active content policy options, and easy-to-use interface as the e-mail service, making it a good\nSSL decryption. Aladdin added an optional Kaspersky engine in choice for customers looking for both services. We expect\n2008. The eSafe Web Security Gateway is usually deployed as that Symantec will gradually build on MesssageLabs as its\nan in-line bridge, allowing it to see all network traffic, but it can strategic foundation for various SecaaS offerings, starting with\nalso function as a proxy. Symantec’s existing online net backup service and introducing a", "15": "15\nhosted endpoint protection platform (EPP) management server deployment capability with the SWG and Symantec’s endpoint\nservice. MessageLabs has expanded its footprint and now has protection clients. In the near term, this introduces some\nnine datacenters for the Web Security Service, (Arizona, Virginia, disruption risk. Symantec will also face some cultural challenges\nLondon, Amsterdam, Frankfurt, Hong Kong, Tokyo, Osaka and with MessageLabs, particularly in refocusing its sales and\nSydney) and expects to increase that number to 11 in 2010. channel teams on service/selling.\nWe anticipate this expansion will continue with management\ninterface localization, and greater local sales and support, due\n• Despite initial successes, Mi5 lost significant market momentum\nto the Symantec channel.\ndue to the Symantec acquisition, which it is only now beginning\nto regain. Symantec faces credibility challenges with network\n• MessageLabs customers give it high marks for service and equipment buyers after its poorly executed withdrawal from the\nsupport. The service offers strong antivirus, latency, uptime network firewall and IPS markets. While Symantec owns the\nand support service-level agreements. Caching popular necessary technical components of an SWG solution, it has yet\nsites and adding gzip compression are used to accelerate to demonstrate that its SWG business can grow at the same\nwebsite delivery and minimize latency. Malware is filtered with pace or faster than the overall market.\nSymantec’s own antivirus scanner as well as the F-Secure\nengine, augmented by MessageLabs’ Skeptic malware\n• The MessageLabs services have suffered from slow feature\nfilters. The URL database is licensed from Websense, and\ndevelopment to enhance the management interface, especially\nMessageLabs augments it when it discovers URLs that have\nfor a service provider. The dashboard and reporting features\nbeen identified as containing malware. MessageLabs also offers\nhaven’t changed significantly since last year, and reporting has\na hosted enterprise IM solution and IM hygiene services that\nbeen cited as needing significant improvement by customers.\ninclude malware filtering, stripping malicious URL links, DLP and\nOutbound malware reporting is minimal and does not show\nfile transfer blocking.\nseverity indicators or threat detail yet. Links to Symantec’s\nthreat library and correlated data showing high-risk PCs would\n• The appliance-based SSWG is most commonly deployed as be an improvement. The service only supports relatively simple\nan in-line bridge (it may also be deployed out of band, on a policies and does not allow conditions. There is no way to\nmirrored port), which enables bidirSectionalA malwareM scanningP Lprint Epolicies for reporting audit or troubleshooting purposes,\nof most ports and protocols, and provides for simple network although customers can request a printed copy from the\nimplementation. Scale is achieved by correctly sizing the MessageLabs help desk team. The URL policy would benefit\nappliance for the network (up to 1 Gbps), or using a load from advanced options, such as self-authorization, coaching\nbalancer to deploy multiple boxes to get beyond 1 Gbps. In-line and bandwidth limitations. Application control is very limited and\ndeployment allows for very broad protocol-level application based only on URL destination rather than network/protocol\ncontrol with binary control (blocking/allow) and policy control of signatures. IM hygiene and application control are offered as a\na large number of named applications, such as P2P, IM, games separate service and not included in the basic package.\nand remote access. URL filtering is provided by an optional IBM\nURL database.\n• Symantec’s decision to substitute its own malware scanning\nengine (Mi5 had licensed Sunbelt and Sophos) in the SSWG\n• SSWG has strong management interfaces. Policy creation is was shortsighted and is limiting to organizations that already\ndone on single-page view with intelligent options based on use Symantec signatures at the desktop (using different\nprevious selections. The dashboard and reporting interface signatures on the SWG and at the desktop is a stronger\nis also strong. Most notable is the reporting emphasis on defense-in-depth model). While we appreciate SSWG’s intuitive\noutbound traffic that indicates the presence of specific malware, management interface, its unique design can cause some\nthe severity and type of the threat, and quick access to more problems for larger enterprises. For example, it is difficult to\ndetail. Dashboard data is hyperlinked to relevant reports, and add users to multiple groups for policy, the dashboard is not\nlogs with granular details (for example, geolocation data, search customizable and some customers complained that they\nterms, file names/types and cross-referencing to greatly aid couldn’t configure complex granular policy or integrate with\nforensic analysis). SSWG provides a centralized server for less-common directory environments. SSWG does not proxy\nconfiguration and consolidated reporting, and long-term storage applications or offer a cache, although this is in the road map\nof log data. Symantec replaced the Sophos and Sunbelt scan for 2010. SSWG application control can be improved, such\nengines and remediation tools (previously licensed by Mi5) with as blocking social networking and blog postings, and granular\nits own scan engine and URL blacklist, while retaining Mi5’s Web application function control. The solution would benefit\nnetwork traffic detection techniques, botnet, malware phone- from the IM control capability Symantec acquired from IMlogic\nhome detection, and inbound content inspection. — currently in the e-mail gateway. SSL decryption is still\nmissing, although this is in the road map for 2010. Advanced\nCautions policy options, such as coaching or self-authorization, time and\nbandwidth quota or bandwidth rate shaping, are missing.\n• The Symantec acquisition adds significant resources to\nMessageLabs, but also introduces a number of potential • Symantec faces the overall challenge of integrating three\ndistractions from its core mission. Symantec is planning a slow security products into an SWG solution with a unified\nand methodical integration, but, at the same time, it plans to management console. In addition to MessageLabs and Mi5,\nexpand its range of SecaaS services and create integrated Symantec also owns DLP technology from its Vontu acquisition.", "16": "16\nCurrently, Symantec has some interoperability between Vontu • IWSS is software-based — it does not offer an SWG hardware\nand the MessageLabs Web Security Service; however, Gartner appliance. Trend Micro’s SecaaS solution has not been\nexpects that full integration of DLP capabilities with its more successful. IWSS solutions are still lacking in numerous\ncomprehensive Vontu technology will require a six- to 12-month large-enterprise features, such as advanced role-based\nintegration effort, and will necessitate evolving packaging and administration, policy summaries and multiple directory\npricing as Symantec attempts to balance single-channel DLP synchronization. Bandwidth control is limited to quotas only.\nneeds with enterprise market needs. The outbound malware detection report, which is significantly\nimproved in V5, still lacks severity indicators to enable prioritized\nTrend Micro remediation.\nTrend Micro is the only EPP vendor that has a long history of\nfocus on antivirus for the Web gateway market. As a result, it has • Application control is limited to binary blocking of some P2P,\na respectable market share with global enterprises. However, the IM and URL categorization blocking. Trend Micro does not\ncompany has not sufficiently invested in advanced features that have any onboard DLP, although it does offer an endpoint DLP\ndifferentiate its Interscan Web Security Suite (IWSS) SWG offering solution.\nand allow it to break into the Leaders quadrant. Still, Trend Micro is\na respected shortlist inclusion for midsize and smaller organizations.\n• Like other EPP vendors in this market, Trend Micro’s biggest\nchallenge in the enterprise is offering buyers a suite that\nStrengths provides sufficient “defenses in depth.” Malware detection is\nprovided by the same signatures as for e-mail and end nodes.\n• The management interface is significantly improved in the\nrecently launched V5, with a very customizable Adobe Flex • There is no ability to protect off-LAN devices without OfficeScan\ndashboard environment and significantly improved advanced EPP or apply URL filtering policy/reporting for mobile devices.\nreporting. New customized reports can be created using\nopen-source iReport and added as a dashboard element or in\nWebroot Software\ncompletely new tabs. Dashboards provide quick hyperlinked\ndrill-down into detailed logs. In diSstributedA environMments, a PWLebrooEt Software is better known for its endpoint spyware\ncentralized IWSS instance can act as a consolidated reporting protection solutions; with the acquisition of Email Systems in 2007,\nengine/database and remove a task from the scan engine to the company is offering e-mail security and Webroot created its\nimprove and consolidate local performance. own SWG services via a SecaaS offering. Webroot is a good\nshortlist inclusion for SMBs looking for service provider options in\nsupported geographies.\n• Malware detection is provided by Trend Micro’s signature\ndatabase, and reputation service is augmented by its in-the-\nStrengths\ncloud “smart protection network.” Trend Micro’s damage\ncleanup service can provide remote client remediation for\nknown threats. IWSS offers a quarantine disposition action for • Malware protection is provided by Webroot and a Sophos\nparking suspicious files or blocked FTP file types. Suspicious malware signature database. Nonsignature threat detection\nfiles can be automatically sent to Trend Micro labs for analysis. capabilities include an anti-phishing engine, as well as\nheuristic-based JavaScript, XSS, Shellcode, and polymorphic\nattack analysis. Webroot has had considerable experience\n• Trend Micro offers its own URL categorization database and\nand a strong track record in the area of Web-borne malware\noffers time of day, and time and bandwidth quota policy\ndetection, which has been the company’s focus since its\noptions. Application control includes some P2P and IM traffic\ninception in 1997.\ntypes that are detected by network signatures.\n• Webroot operates three data centers — in the U.S., U.K. and\n• The IWSS family of products offers numerous product\nSydney, Australia — and uses Amazon infrastructure in the\nplatform options (for example, Crossbeam integration, Linux,\neastern U.S. and Dublin, Ireland. The service uses compression\nWindows, Solaris and VMware virtual appliance) and numerous\nand HTTP translation to accelerate content from the data center\ndeployment options (for example, ICAP, WCCP, transparent\nto end users to minimize latency. HTTP traffic is redirected\nbridge, and forward and reverse proxy). Multiple IWSS\nto these proxies via a local proxy or firewall settings, a client\nproducts can be pooled or clustered with automatic policy\nproxy setting or a client software agent. The mobile client is\nsynchronization for increased redundancy and scale.\neasy to use and configurable via the cloud-based centralized\nmanagement console, it is not proxy auto-configuration (PAC)\nCautions\nfile-based, nor does it require an authentication server on\npremises.\n• Despite Trend Micro’s history in this market, it has failed to lead\nthe market with enterprise-class features. This has allowed the\n• The Web management interface provides centralized\nmore aggressive competition to steal mind share, particularly\nmanagement of Web and e-mail service, is user friendly and can\nin large enterprises. Trend Micro needs to invest in advanced\nbe administered by nontechnical users. The unique graphical\nproduct features if it wants to regain momentum in the SWG\nview of its URL-filtering policy is especially easy to understand.\nmarket.\nIt provides a granular role-based administration rights capability,", "17": "17\nand good role-based policy and policy audit logs. Log search share, the breadth and depth of its initial offerings and the success\ncapability is also very good. Log data includes the search term of its proxy-based SWG platform moved it into the Leader quadrant\nquery string and has a link to the search results, which is a this year. Given the breadth of its product family, Websense is a good\ngood feature to help understand user intent. shortlist inclusion for any size company.\nStrengths\n• Policy options include blocking certain files by type and size,\nand a soft block function that enables users to visit a blocked\ncategory for a length of time. Quota-based policies can be • Websense’s URL-filtering solution has a solid North American\nconfigured to limit the amount of bandwidth used in a specified and EMEA presence in companies of all sizes, and a strong\ntime window. The URL filtering provides an anonymous proxy distribution channel that enables it to target large enterprises and\ndetection capability. SMBs. The introduction of its proxy-based SWG solution gives\nWebsense the ability to up-sell its installed base from the URL-\nfiltering solution to the broader SWG capability, and gain more\n• The service includes search results (Google, Yahoo, MSN Live\naccount ownership and loyalty in the process. The company is\nSearch and Ask.com) decorated with security warnings and\nprimarily focused on the Web gateway market, and has extensive\nURL categorization icons.\nexperience and resources dedicated to detecting Web-borne\nmalware. With the exception of the third-party signatures,\nCautions\nWebsense owns all the core technology in its products. It is well-\npositioned to execute on its road map to offer hybrid (customer\n• Webroot has had initial success in the SMB market (fewer than premises-based and SecaaS-based) SWG solutions that can be\n1,000 seats), but has failed to get the attention of the larger managed by a unified policy console.\nenterprise customers. It needs to improve its enterprise feature\nset and expand its global footprint and channel to break out\n• Websense’s management console is one of the best in the\nof its SMB niche. Although Webroot has done a good job of\nmarket and is consistent across all its offerings (except the\ncatching up to the state of the art in the management console\nSecaaS solution). Navigation is task-based, and policy creation\nand feature set, it has not yet distiSnguisheAd itself wMith any PLE\nis intuitive and easy to use. There is a useful customizable\noutstanding differentiated feature that would move it into the\ntoolbox element that enables common tasks to be consolidated\nVisionaries quadrant.\ninto a single menu. The dashboard includes hyperlink drill-\ndowns into more-detailed reporting data. Policy can be\n• The dashboard is very basic and static, with little customization. developed in a single pane, with extensive parameters and a\nThere are no hyperlinks to drill down into the detail from logical workflow. URL policy parameters are broad, and include\ndashboard elements. Reporting is basic, with limited advanced options such as bandwidth, time restrictions and quotas.\nfunctions. There is no ability to create ad hoc reports, although Optional category-based SSL traffic decryption is included to\nadministrators can change options on the 25 report templates filter encrypted Web traffic.\nto get different slices of data. Reports do not offer multiple\nchart types — only bar charts and tables. Outbound threats\n• In addition to third-party malware signatures and the Websense\nare in static reports, but not in real-time dashboard views, and\ndatabase of infected URLS, the WSG provides very extensive\nthreat information is restricted to threat types. There are no\non-box, real-time malware content analysis to detect suspicious\nlinks to malware encyclopedia information or severity indicators.\ncode fragments and other signs of infection.\nThere is no user-readable policy summary for auditing or\ntroubleshooting. Limited customization capability makes it\ndifficult to create regional block pages for global companies. • Application control includes more than 125 applications, such\nas IM and chat, streaming media, P2P file sharing, e-mail\nand collaboration based on network signatures. Websense’s\n• Application control is limited to blocking URLs of registration\nNetwork Agent provides an out-of-band network analyzer that\nservers, and the solution offers no DLP capability.\nenables the combined solution to monitor all traffic (not just\ntraffic destined for the proxy) for malware application and DLP\n• Like other SWG SecaaS providers, inbound and outbound violations, and provides overall traffic analysis capabilities.\nmalware detection is limited to HTTP traffic types that are\nredirected to the service.\n• The acquisition of PortAuthority in 2007 provided Websense\nwith strong DLP technology, which is now offered as an\nWebsense additional module that enables granular content-aware policy\nand reporting. Data detection techniques are complete, and the\nWebsense has a long history in the Web filtering market, and the product includes several predefined dictionaries and policies.\ncompany dominates the market for URL-filtering software. The\nacquisition of SurfControl in 2007 added a SecaaS offering now called • Websense is one of the few vendors that can offer software,\nWebsense Hosted Web Security Gateway (HWSG). Websense’s first appliances, client software and SecaaS. Websense software\nproxy-based multifunction SWG solution, “Websense Web Security solutions can run on Windows, Linux and Solaris, as well as on\nGateway (WSG) — released just prior to last year’s Magic Quadrant — numerous third-party network hardware platforms (firewalls and\nis gaining traction now that it has been released in an appliance form- proxies). In addition, Websense has partnered with Crossbeam,\nfactor. Websense’s dedicated focus on the SWG market, its market Celestix Networks, Resilience and HP for preinstalled solutions.", "18": "18\nCautions • The policy manager is very easy to use and logical. All policy\nis user-based and follows roaming users, allowing immediate\nservice at the nearest enforcement node.\n• Despite significant technology investments, Websense still\nneeds to prove that it can make the transition from a relatively\nuncontested software-based URL-filtering vendor to a • Zscaler has several methods for redirecting clients that are very\nmultiplatform SWG vendor in a much more hotly contested simple to set up. It is the only vendor to offer redirection with\nmarket against significantly more strategic competitors. While authentication without a software client on mobile devices. It\nWebsense has a significant installed base, up-selling clients also supports standards-based Generic Routing Encapsulation\nto the WSG platform or service creates opportunities for the (GRE) tunnels, and can host customer PAC files.\ncompetition to get a foot in the door.\n• Zscaler offers two levels of security protection. In addition\n• The WSG appliance and software is still not widely deployed, to using several signature and blacklist-based filters, Zscaler\nand early feedback regarding service and support from v10000 has numerous advanced security checks including page\ncustomers has been mixed. It needs to add various sizes of analysis, URL reputation, and script analysis. Zscaler provides\nappliances to appeal to the SMB market. Some aspects of reporting and policy options to enable organizations to block\nWebsense’s reporting need improving. Specifically, outbound unsupported or vulnerable browsers or browser versions.\nmalware reporting is lacking in actionable detail, and scheduled\nreports lack more-visual graphs.\n• Application control includes numerous named applications that\ncan be blocked using a combination of destination URL and\n• Websense needs to add more data centers to improve the some network signature analysis. Companies under pressure\ngeographic coverage of its SecaaS service, particularly in the to liberalize productivity filters will appreciate the option to allow\nMiddle East and Asia/Pacific. Websense is busy overlaying the Web 2.0/social networking page view while blocking posting\nsame management interface as the appliance and software to these sites, as well as optional DLP, which is adequate\nto the SecaaS service, which will allow customers to move for most organizations’ corporate or government-compliance\nseamlessly from appliances to services or use a hybrid needs. Zscaler offers granular, policy-based control of Web-\napproach. However, the service dSashboaArd wouldM benefit froPm LbaseEd applications, such as IM, blogs, streaming and Web mail,\nmore performance metrics and service-level commitments. including QoS bandwidth control.\n• Websense is more expensive than its counterparts; however, it • Zscaler’s unique architecture and highly scalable purpose-built\ngenerally matches competitive prices in large, contested deals. enforcement nodes enables fast global deployments. Its SecaaS\noffering already has the largest global footprint of data centers\nZscaler (among all SecaaS SWG vendors in this Magic Quadrant)\nand continues to expand. It also allows for “private node” and\nZscaler is a new SecaaS vendor in the SWG market in 2009. The\n“private cloud” deployments for very large organizations, service\ncompany invested significant resources in a unique multitenancy\nproviders, or organizations in unique geographies.\narchitecture that disconnects policy administration, reporting and\nenforcement, enabling each element to scale independently. It\nCautions\nis now investing in rapid feature development, global rollout of\nenforcement nodes and sales presence, resulting in impressive\ngrowth in numerous global markets among small and very • Although Zscaler has had early market success competing\nlarge enterprise clients. Zscaler is a very strong choice for any against other SecaaS startups, the market will be different\norganization interested in a SecaaS SWG solution. in 2010 with the Cisco/ScanSafe and Barracuda/Purewire\ndeals. Now, it is competing against more-mature organizations\nStrengths with better-established sales and support organizations. For\nthe most part, these competitors are able to offer a broader\nportfolio of solutions, as well as multiple delivery form factors\n• The management interface (Flash-based) is easy to use, even\nand hybrid offerings.\nfor nontechnical administrators. All reports are dashboards\nand are based on live data and allow hyperlinked drill down\ninto detailed log data. Zscaler’s Nanolog technology reduces • While most of Zscaler’s customers in 2009 were from the SMB\nlog size by a factor of 50, enabling very fast reports and market, it also won several large deals that were greater than\nlonger retention of detailed data. The dashboard has a unique 100,000 seats. Zscaler needs to prove its ability to successfully\n“compared to industry peers” report, which shows relative data deploy and support these large enterprise customers.\ncompared to averages for Zscaler customers. Zscaler provides\nlatency statistics for each stage of a round trip Web request,\nenabling fast troubleshooting as well as SLA-compliance\nmonitoring.", "19": "19\n• Zscaler does not offer e-mail security or other services for Acronym Key and Glossary Terms\ncompanies looking to consolidate SecaaS vendors (e-mail spam\nand virus filtering is scheduled for 1Q10). ARM advanced reporting module\nCSG content security gateway\nCSV comma-separated values\n• Although its enforcement nodes are widely geographically\nDLP data leak prevention\ndispersed, the reporting and policy data reside only in the U.S.\nEMEA Europe, the Middle East and Africa\nand England so far. The company has plans to add reporting\nePO epolicy orchestrator\nand policy servers to its Asia/Pacific data centers in the future.\nGLBA Gramm-Leach-Bliley Act\nGRE Generic Routing Encapsulation\n• The management interface is missing full customization of GUI graphical user interface\ndashboard elements. Report information about threats could HTTP/S HTTP over SSL\nbe improved. Outbound threats reports do not include any ICAP Internet Content Adaptation Protocol\nseverity indicator or link to detailed information about threats, IM instant messaging\nand there is no consolidated threat report with drill-down data. IP Internet protocol\nIn particular, a consolidated and prioritized report on outbound IWSS Interscan Web Security Suite\ntraffic indicating action items for PC operations would be useful MMC Microsoft management console\n(i.e., combination of application and security traffic types). OS operating system\nPAC proxy auto-configuration\nP2P peer-to-peer\n• There are no native FTP application controls, but it does\nPCI Payment Card Industry\nsupport stand-alone FTP clients as well as FTP over HTTP.\nSecaaS Security software as a service\nSMB small or midsize business\n• Clientless redirection methods for laptops are lightweight and SSL Secure Sockets Layer\neasy to use, but not tamperproof. Like other SecaaS offerings, SOX Sarbanes-Oxley Act\napplication control and outbound threats that do not use port SQL Structured Query Language\n80, and 443 (HTTP, HTTP/S) can Sevade dAetectionM unless all PLSWGE secure Web gateway\ntraffic is redirected to Zscaler. TCO total cost of ownership\nUSG unified security gateway\nVendors Added or Dropped UTM unified threat management\nVoIP voice over IP\nWe review and adjust our inclusion criteria for Magic Quadrants\nWCCP Web Cache Communication Protocol\nand MarketScopes as markets change. As a result of these\nadjustments, the mix of vendors in any Magic Quadrant or\nMarketScope may change over time. A vendor appearing in a\nMagic Quadrant or MarketScope one year and not the next does\nnot necessarily indicate that we have changed our opinion of that\nvendor. This may be a reflection of a change in the market and,\ntherefore, changed evaluation criteria, or a change of focus by a\nvendor.", "20": "20\nEvaluation Criteria Definitions\nAbility to Execute\nProduct/Service: Core goods and services offered by the vendor that compete in/serve the defined market. This includes current\nproduct/service capabilities, quality, feature sets and skills, whether offered natively or through OEM agreements/partnerships as\ndefined in the market definition and detailed in the subcriteria.\nOverall Viability (Business Unit, Financial, Strategy, Organization): Viability includes an assessment of the overall organization’s\nfinancial health, the financial and practical success of the business unit, and the likelihood that the individual business unit will\ncontinue investing in the product, will continue offering the product and will advance the state of the art within the organization’s\nportfolio of products.\nSales Execution/Pricing: The vendor’s capabilities in all presales activities and the structure that supports them. This includes\ndeal management, pricing and negotiation, presales support, and the overall effectiveness of the sales channel.\nMarket Responsiveness and Track Record: Ability to respond, change direction, be flexible and achieve competitive success\nas opportunities develop, competitors act, customer needs evolve and market dynamics change. This criterion also considers the\nvendor’s history of responsiveness.\nMarketing Execution: The clarity, quality, creativity and efficacy of programs designed to deliver the organization’s message to\ninfluence the market, promote the brand and business, increase awareness of the products, and establish a positive identification\nwith the product/brand and organization in the minds of buyers. This “mind share” can be driven by a combination of publicity,\npromotional initiatives, thought leadership, word-of-mouth and sales activities.\nCustomer Experience: Relationships, products and services/programs that enable clients to be successful with the products\nevaluated. Specifically, this includeSs the waAys custMomers recePive techLnical suEpport or account support. This can also include\nancillary tools, customer support programs (and the quality thereof), availability of user groups, service-level agreements and so on.\nOperations: The ability of the organization to meet its goals and commitments. Factors include the quality of the organizational\nstructure, including skills, experiences, programs, systems and other vehicles that enable the organization to operate effectively\nand efficiently on an ongoing basis.\nCompleteness of Vision\nMarket Understanding: Ability of the vendor to understand buyers’ wants and needs and to translate those into products and\nservices. Vendors that show the highest degree of vision listen to and understand buyers’ wants and needs, and can shape or\nenhance those with their added vision.\nMarketing Strategy: A clear, differentiated set of messages consistently communicated throughout the organization and\nexternalized through the Web site, advertising, customer programs and positioning statements.\nSales Strategy: The strategy for selling products that uses the appropriate network of direct and indirect sales, marketing, service\nand communication affiliates that extend the scope and depth of market reach, skills, expertise, technologies, services, and the\ncustomer base.\nOffering (Product) Strategy: The vendor’s approach to product development and delivery that emphasizes differentiation,\nfunctionality, methodology and feature sets as they map to current and future requirements.\nBusiness Model: The soundness and logic of the vendor’s underlying business proposition.\nVertical/Industry Strategy: The vendor’s strategy to direct resources, skills and offerings to meet the specific needs of individual\nmarket segments, including vertical markets.\nInnovation: Direct, related, complementary and synergistic layouts of resources, expertise or capital for investment, consolidation,\ndefensive or pre-emptive purposes.\nGeographic Strategy: The vendor’s strategy to direct resources, skills and offerings to meet the specific needs of geographies\noutside the “home” or native geography, either directly or through partners, channels and subsidiaries as appropriate for that\ngeography and market."}